const data = {
  books: [
    {
      id: 0,
      author: "Олег Денисенко",
      title: "Кто такие эти мужчины. Ответы на главные вопросы женщин",
      text: "",
      annotate:
        "Книга Олега Денисенко — результат многолетнего исследования разных аспектов человеческих взаимоотношений. Ее автор — психолог, публицист, популярный блогер, а также автор курсов и обучающих интенсивов. На страницах этого издания читатели смогут найти не только найти ответы на те самые острые вопросы прекрасного пола, но и эффективную методику построения гармоничной любви к самому себе и своему партнеру. На собственном опыте и опыте живых историй из своего окружения писатель наглядно демонстрирует то, как легко можно научиться управлять ситуацией, понимать близкого человека и перейти на совершенно новый уровень отношений.",
      review:
        "Спонсором моей бессонной ночи является #книгаолегаденисенко. Книга чуть не вспыхнула и не прогорела от моей скорости чтения. Тут нет нудных объяснений, всё кристально чисто и понятно. Мы всегда задумываемся о проблемах в межличностных отношениях, но не понимаем их корень, их суть… Эта книга поможет разобраться во многих вопросах и рекомендована к прочтению не только женщинам, но и мужчинам.",
      image_2d: "/images/Denisenko1.jpg",
      image_3d: "/images/Denisenko2.png",
      price: 890,
      isBestseller: true
    },
    {
      id: 1,
      author: "Евгений Солодар",
      title: "Что на ужин? Конструктор домашнего меню",
      text: "",
      annotate:
        "Если для вас, как и для миллионов других людей по всему миру, этот вопрос не теряет своей актуальности каждый вечер, обязательно освободите место на книжкой полке под это издание. В ней шеф-повар сети ресторанов Soiree и автор популярного youtube-канала о еде раскрывает свои секреты составления сбалансированных, вкусных и нестандартных меню для всей семьи на неделю. Книга дополнена ярким иллюстративным материалом, блоком для заметок и фиксирования интересных гастрономических идей.",
      review:
        "Брала в качестве подарка на День рождения. Издание солидное, подарить не стыдно, особенно тем, кто всерьез увлекается готовкой. Внутри все очень красиво оформлено, все рецепты с картинками и описанием. Больше всего нравится то, что эти рецепты могут подойти как на каждый день, так и на праздники для большой и веселой встречи с родными и друзьями. По ним вполне можно что-нибудь сделать и удивить гостей и близких! Подруга была в восторге",
      image_2d: "/images/Solodar1.jpg",
      image_3d: "/images/Solodar2.png",
      price: 790,
      isBestseller: true
    },
    {
      id: 2,
      author: "Алексей Еремеев",
      title: "Путеводитель по музыкальным магазинам мира",
      text: "",
      annotate:
        "Алексей Еремеев — авторитетный музыкальный критик и автор популярного тематического блога “Now playing”. Особая страсть Алексея — посещение музыкальных магазинов по всему миру. Когда их накопилось больше сотни, он решил создать фотопутеводитель: на его страницах автор не только рассказывает об истории их открытия и ассортименте, но и ведет увлекательные беседы с покупателями и продавцами, анализирует раритеты на полках и составляет фирменный плейлист каждого места — будь то винтажная noname-лавка с коллекционными изданиями винила или сетевой маркет HMV в центре Лондона.",
      review: "",
      image_2d: "/images/Eremeev1.jpg",
      image_3d: "/images/Eremeev2.png",
      price: 1200,
      isBestseller: true
    },
    {
      id: 3,
      author: "Татьяна Быстрых",
      title: "Self Media Marketing. Продвижение своего бренда в соцсетях",
      text: "Это четвертый товар в наше выборке",
      annotate:
        "Как грамотно продвигать свой бренд в соцсетях, сохраняя бюджет на оптимальном уровне? Стоит ли брать удаленного специалиста или взращивать собственный штат? Из чего состоит стратегия успешного взаимодействия с блогерами? На эти и многие другие вопросы дает ответ в своей новой книге Татьяна Быстрых — руководитель отдела развития коммуникационного агентства LOMO, автор образовательных SMM-курсов и блогер с миллионной аудиторией в Инстаграме. Полезное практическое приложение поможет читателям заполнить бриф на продвижение для своего бренда, рассчитать коэффициенты эффективности и составить контент-план на месяц.",
      review:
        "В первую очередь, книга разрушает миф о том, что существует какой-то один единственный “золотой рецепт” успешного блога. Назначение этой книги — поделиться персональным опытом, инсайтами и инструментами, которые работают. Она создана для того, чтобы снять розовые очки с тех, кто считает, что успешное продвижение —  это только про контент и что реклама не нужна. Жестко и честно. Рекомендую, как новичкам, так и тем, кто уже добился каких-то успехов в деятельности",
      image_2d: "/images/Bystrykh1.jpg",
      image_3d: "/images/Bystrykh2.png",
      price: 820,
      isBestseller: true
    },
    {
      id: 4,
      author: "Ксения Глушкова",
      title: "Мыльный пузырь. История бренда FOAMY",
      text: "",
      annotate:
        "В 18 лет Ксения устроилась на свою первую работу — стажером в сетевой beauty-гигант Lush. В тот же момент у нее появилась мечта — создать собственный косметический бренд. Так спустя пять лет родилась марка FOAMY, завоевавшая сердца миллениалов по всей России. О том, как создавалась его философия и выстраивалась стратегия продвижения, автор подробно рассказывает в своей книге. Это издание будет интересно всем, кто следит за молодым бизнесом в нашей стране, планирует развивать личный бренд или регулярно покупает бестселлеры самой «мыльной» российской марки.",
      review: "",
      image_2d: "/images/Glushkova1.jpg",
      image_3d: "/images/Glushkova2.png",
      price: 990,
      isBestseller: false
    },
    {
      id: 5,
      author: "Маша Волк",
      title: "Мыслить шире",
      text: "",
      annotate:
        "Маша Волк — ведущий преподаватель креативной школы Mind up. Под ее руководством проходят такие курсы, как «Стратегическое мышление», «Продуктовый креатив», «Портрет потребителя». В своей новой книге Мария предлагает эффективные и нестандартные техники генерации свежих идей, работы с целевой аудиторией и поиска инсайтов: насыщенный иллюстрациями и живыми примерами материал поможет как начинающим специалистам, так и профессионалам своего дела. Новинка будет интересна широкому кругу лиц: от маркетологов и креаторов до владельцев бизнеса и руководителей дизайн-студий.",
      review: "",
      image_2d: "/images/Volk1.jpg",
      image_3d: "/images/Volk2.png",
      price: 930,
      isBestseller: false
    },
    {
      id: 6,
      author: "Ирина Гассман",
      title: "Порядок вещей",
      text: "",
      annotate:
        "За последние несколько лет имя Ирины Гассман стало синонимом стиля для широкой аудитории как в нашей стране, так и за рубежом. Окончив Королевский колледж искусств в Лондоне, Ирина решила открыть авторскую школу моды и стиля: с 2015 года ее выпускниками стали более 3 тысяч человек. Кроме преподавания в офлайн и онлайн режиме, она ведет образовательный канал на Youtube и авторскую колонку в журнале Outfit. В этой книге собраны наиболее практичные и универсальные правила организации гардероба и подбора вещей, которые помогут людям выглядеть стильно в любой ситуации — независимо от возраста и обстоятельств.",
      review:
        "Прекрасная книга! Прочитала, и сразу захотелось прошерстить свой гардероб, перемерить, выбросить, составить комплекты. Думаю, подобная книга должна быть у каждого, кому не безразличен его облик. Даже, если уверена, что одета идеально, такую книгу приятно почитать просто для релакса. Кстати, никогда не покупала рубашку-поло, даже не обращала на них внимание, пока не прочитала книгу, а вчера случайно увидела в магазине, примерила и влюбилась. Прочитайте — не пожалеете",
      image_2d: "/images/Gassman1.jpg",
      image_3d: "/images/Gassman2.png",
      price: 690,
      isBestseller: false
    },
    {
      id: 7,
      author: "Тимофей Вознесенский",
      title: "Квартиры Петербурга",
      text: "",
      annotate:
        "Тимофей Вознесенский — культуролог, автор колонки о городской жизни в журнале «Поребрик» и увлеченный риэлтор с опытом работы более 25 лет. Тимофей специализируется на старом фонде Петербурга: знает специфику планировок, секреты постройки домов и то, какая панорама открывается с крыши каждого из них. В своей новой книге писатель делится коллекцией уникальных историй от постояльцев парадных — сентиментальных, грустных и временами забавных. Новинка будет интересна всем, кому небезразлична архитектурная судьба города и людей, которые живут в нем.",
      review: "",
      image_2d: "/images/Voznesennskiy1.jpg",
      image_3d: "/images/Voznesennskiy2.png",
      price: 790,
      isBestseller: false
    },
    {
      id: 8,
      author: "Алина Игнатюк",
      title: "365",
      text: "",
      annotate:
        "Тайм-менеджмент — тема, которая не теряет своей актуальности из года в год. В новой книге-методичке блогер Алина Игнатюк делится с читателями полезными техниками, которые помогут организовать свое время и научат планировать как краткосрочные, так и долгосрочные задачи. В практическом приложении — авторский трекер полезных привычек, уже завоевавший популярность среди подписчиков в Инстаграме, конструктор распорядка дня и график целей на ближайшие пять лет. Издание станет отличным подарком для широкого круга людей: студентов, бизнесменов, специалистов различных отраслей.",
      review:
        "Я искренне сожалею о том, что не смог порекомендовать эту книгу чуть раньше — это действительно полезное руководство по самоорганизации. Эта книга совершенно непохожа на привычные и малоэффективные пособия по тайм-менеджменту. Она даже не о том, как сэкономить Х минут в день, а о том, как жить счастливо, успевая многое. Масса отличных примеров и увлекательных историй прилагается",
      image_2d: "/images/Ignaytuk1.jpg",
      image_3d: "/images/Ignaytuk2.png",
      price: 990,
      isBestseller: false
    }
  ],
  faq: [
    {
      title: `Как сделать заказ?`,
      text: `— выберите нужное вам количество книг,\n— нажмите на кнопку «Оформить заказ»,\n— выберите необходимую вам страну,\n— укажите ваш номер телефона и email,\n— заполните ФИО,\n— выберите удобный для вас способ доставки,\n— выберите из списка или заполните удобный для вас адрес доставки,\n— выберите удобный для вас способ оплаты,\n— нажмите на кнопку «Оплатить»,\n— оплатите заказ.\n\n После успешного проведения платежа, на вашу почту придет письмо-подтверждение.`
    },
    {
      title: `Когда я получу книгу при оформлении предзаказа?`,
      text: `Как только книги приедут из типографии на склад, они будут отправлены в первую очередь тем, кто оформил предзаказ. Длительность доставки зависит от города и выбранной доставочной службы.`
    },
    {
      title: `Как оплатить заказ`,
      text: `Оплатить можно на сайте любым удобным для вас способом:\n— любой банковской картой,\n— системой Яндекс.Деньги,\n— Qiwi-кошельком,\n— с помощью сервиса Сбербанк Онлайн,\n— с помощью системы PayPal.`
    },
    {
      title: `Как оформить заказ с самовывозом?`,
      text: `При оформлении заказа выбрать кнопку «Пункт выдачи заказов» и найти подходящий для вас пункт в вашем городе.`
    },
    {
      title: `Как я получу книгу?`,
      text: `После оформления заказа на почту приходит чек об оплате и письмо-оповещение о покупке. Заказ обрабатывается от 1 до 5 дней.`
    },
    {
      title: `Где найти номер для отслеживания посылки?`,
      text: `В течение 1-3 рабочих дней после отгрузки вы получите трек-номер для отслеживания.`
    },
    {
      title: `Как заказать, если моего населенного пункта нет на карте?`,
      text: `Напишите нам на почту order@ampersand.com и мы предложим вам индивидуальные условия заказа.`
    },
    {
      title: `Что делать, если мне не пришло письмо-уведомление о заказе?`,
      text: `Пожалуйста, проверьте папку «Спам» или напишите нашей службе поддержки — support@ampersand.com.`
    },
    {
      title: `Хочу издать книгу в вашем агентстве. Как с вами связаться?`,
      text: `Напишите нам на почту welcome@ampersand.com.`
    },
    {
      title: `Куда мне обратиться с предложением о рекламе?`,
      text: `Присылайте свои коммерческие запросы на почту welcome@ampersand.com.`
    }
  ]
};

export default data;
