import React, {useEffect} from "react";
import anime from "animejs";

// Images
import {ReactComponent as Logo} from "../static/logo.svg";
import {ReactComponent as DeliveryImage} from "../static/delivery_image.svg";

export default function Delivery() {
  useEffect(() => {
    anime({
      targets: ".morthing",
      d: [
        {
          value:
            "M43.9262 354.758C54.089 346.881 64.5795 339.168 70.8083 327.68C101.952 269.75 37.0417 202.137 73.1031 139.283C91.2977 107.446 127.359 84.1422 162.437 97.435C199.81 111.548 235.215 126.318 275.539 114.667C346.022 94.1529 382.575 -1.52282 459.288 0.118272C522.395 1.43115 592.387 67.8954 555.998 136.821C528.46 189.008 545.671 232.169 609.434 241.195C673.361 250.221 700.899 325.711 681.885 358.205C662.871 390.534 626.645 424.833 661.231 439.11C695.818 453.388 707.783 500.323 704.341 532.653C700.899 565.146 694.014 577.783 694.014 577.783H31.4686C31.4686 577.783 3.43909 541.843 -0.00311279 458.968C-1.47839 423.028 5.89783 387.908 32.9438 363.456C36.55 360.338 40.3201 357.548 43.9262 354.758Z",
          duration: 1
        },
        {
          value:
            "M49.972 358.383C61.3024 349.595 87.1866 321.788 94.131 308.971C128.853 244.339 60.8763 197.827 101.081 127.701C121.366 92.1807 161.571 66.1812 200.679 81.0119C242.345 96.758 271.574 94.0116 316.53 81.0119C415.765 52.317 449.234 -1.43672 534.76 0.394233C605.118 1.85899 660.12 66.6632 619.55 143.563C588.848 201.787 616.57 239.133 687.659 249.203C727.969 249.203 759.4 322.13 738.201 358.383C717.003 394.453 699.642 436.565 738.201 452.494C776.761 468.423 790.102 520.79 786.264 556.859C782.427 593.112 774.751 607.21 774.751 607.21H36.0831C36.0831 607.21 4.83319 567.111 0.995483 474.648C-0.64925 434.551 7.5744 395.368 37.7278 368.087C41.7483 364.608 45.9515 361.496 49.972 358.383Z"
        },
        {
          value:
            "M47.972 351.677C59.3024 342.889 85.8807 318.197 92.8251 305.38C127.547 240.748 81.3065 179.044 105.849 136.068C126.134 100.548 174.485 76.2452 213.593 91.0759C255.26 106.822 310.717 138.412 355.673 125.412C454.908 96.7171 322.521 15.2997 442.106 1.09116C524.329 -8.67821 611.418 55.2366 611.418 145.54C611.418 220.997 675.354 211.844 675.354 211.844C727.45 211.844 757.4 295.175 736.201 331.428C715.003 367.498 697.642 429.859 736.201 445.788C774.761 461.717 788.102 514.083 784.264 550.153C780.427 586.406 772.751 600.504 772.751 600.504H34.0831C34.0831 600.504 4.31073 565.971 0.473022 473.508C-1.17171 433.411 5.5744 388.663 35.7278 361.381C39.7483 357.903 43.9515 354.79 47.972 351.677Z"
        },
        {
          value:
            "M54.6323 344.288C63.5736 337.365 79.7128 326.767 105.595 278.589C140.317 213.956 84.1394 157.911 108.682 114.935C128.967 79.4146 172.906 61.7238 212.014 76.5545C253.681 92.3007 301.39 117.602 346.346 104.602C445.58 75.9073 386.245 11.9636 476.249 1.26981C558.472 -8.49956 617.961 45.7338 617.961 136.037C617.961 211.494 679.96 200.553 679.96 200.553C736.205 200.553 766.111 292.727 744.912 328.98C723.713 365.049 697.645 429.827 736.205 445.757C774.765 461.686 788.603 501.05 784.766 537.12C780.928 573.373 772.754 600.472 772.754 600.472H34.0863C34.0863 600.472 4.31391 565.94 0.476196 473.477C-1.16854 433.379 5.57757 388.631 35.731 361.35C39.7515 357.871 50.6119 347.4 54.6323 344.288Z"
        },
        {
          value:
            "M43.9262 354.758C54.089 346.881 64.5795 339.168 70.8083 327.68C101.952 269.75 37.0417 202.137 73.1031 139.283C91.2977 107.446 127.359 84.1422 162.437 97.435C199.81 111.548 235.215 126.318 275.539 114.667C346.022 94.1529 382.575 -1.52282 459.288 0.118272C522.395 1.43115 592.387 67.8954 555.998 136.821C528.46 189.008 545.671 232.169 609.434 241.195C673.361 250.221 700.899 325.711 681.885 358.205C662.871 390.534 626.645 424.833 661.231 439.11C695.818 453.388 707.783 500.323 704.341 532.653C700.899 565.146 694.014 577.783 694.014 577.783H31.4686C31.4686 577.783 3.43909 541.843 -0.00311279 458.968C-1.47839 423.028 5.89783 387.908 32.9438 363.456C36.55 360.338 40.3201 357.548 43.9262 354.758Z"
        }
      ],
      easing: "linear",
      duration: 25000,
      loop: true
    });
  }, []);

  return (
    <div className="delivery">
      <div className="page_title">
        <h1>
          <Logo />
          <span>Доставка</span>
        </h1>
      </div>
      <div className="delivery_content">
        <div className="text">
          <div className="item first">
            <div className="inner">
              <h1>Доставка почтой России</h1>
              <p>
                <strong>Сроки доставки:</strong>
                от 7 до 28 дней с момента оплаты заказа.
              </p>
              <p>
                <strong>Стоимость доставки:</strong>
                сумма заказа от 0 до 2 000 руб. — 149 руб,
                <br />
                сумма заказа от 2 000 руб. — бесплатно.
              </p>
              <p>
                <strong>Дополнительная информация:</strong>
                — необходимо внести 100% предоплату,
                <br />— после поступления оплаты заказ будет передан в
                распределительный центр Почты России в течение двух рабочих
                дней. Затем в течение трех рабочих дней отправлению будет
                присвоен идентификатор, который будет отправлен на указанный
                вами адрес электронной почты. <br />
                Обратите внимание: срок хранения посылки на почте составляет 15
                дней.
              </p>
            </div>
            <div className="image">
              <DeliveryImage />
            </div>
          </div>
          <div className="item">
            <div className="inner">
              <h1>Доставка в пункты выдачи заказов</h1>
              <p>
                <strong>Сроки доставки:</strong>
                от 2 дней.
              </p>
              <p>
                <strong>Стоимость доставки:</strong>
                сумма заказа от 0 до 2 000 руб. — рассчитывается автоматически
                <br />
                при оформлении заказа,
                <br />
                сумма заказа от 2 000 руб. — бесплатно.
              </p>
              <p>
                <strong>Дополнительная информация:</strong>
                — необходимо внести 100% предоплату,
                <br />
                — для выбора доступна служба Boxberry,
                <br />— отслеживание заказов на сайте Boxberry может начинаться
                с задержкой в несколько дней. Это связано с особенностями
                информобмена и комплектации заказов в интернет-магазине.
              </p>
            </div>
          </div>
          <div className="item">
            <div className="inner">
              <h1>Курьерская доставка по россии и миру</h1>
              <p>
                <strong>Сроки и стоимость доставки:</strong>
                при оформлении покупки стоимость и примерный срок доставки
                рассчитается автоматически.
              </p>
              <p>
                <strong>Дополнительная информация:</strong>
                — необходима 100% предоплата,
                <br />— заказ будет отправлен на следующий день после
                поступления оплаты.
              </p>
              <p>
                <strong>Отследить доставку всегда можно по трек-номеру:</strong>
                <a href="http://www.dhl.ru/ru/express/tracking.html">
                  на сайте DHL
                </a>
              </p>
              <p>
                Обратите внимание: стоимость заказа не учитывает таможенную
                пошлину. При получении посылки вам может потребоваться заплатить
                налог или пошлину, если стоимость отправления будет выше
                установленного законом предела. Узнайте подробности в таможенном
                департаменте своей страны.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}
